EDT/УТ/src/InformationRegisters/ОшибкиSQL/ОшибкиSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиSQL</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаСвязанаСДоступностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаОбработанаРегламентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаРегламентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбработкиРегламентом</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ВнешниеИсточникиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыОперацийADO</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ИнициаторыСостояния/ИнициаторыСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИнициаторыСостояния</name>
  <enumValues>
    <name>Клиент</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
    <comment>2</comment>
  </enumValues>
  <enumValues>
    <name>ИнтернетМагазин</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СторонаПретензий/СторонаПретензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СторонаПретензий</name>
  <enumValues>
    <name>Партнер</name>
  </enumValues>
  <enumValues>
    <name>Компания</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ВидыЗапросовWEBСервис/ВидыЗапросовWEBСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗапросовWEBСервис</name>
  <enumValues>
    <name>GetMapVersionsResult</name>
  </enumValues>
  <enumValues>
    <name>GetMapResult</name>
  </enumValues>
  <enumValues>
    <name>GetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetPolygonsForOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>CreateMapResult</name>
  </enumValues>
  <enumValues>
    <name>SetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetDistanceResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderCarsResult</name>
  </enumValues>
  <enumValues>
    <name>SetAcceptedPlacesResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderLocationFlagResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersStatusResult</name>
  </enumValues>
  <enumValues>
    <name>UpdateReasonsDirectoryResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersFinalStatusResult</name>
  </enumValues>
  <enumValues>
    <name>GetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetRefusedOrderItemsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersDeliveryDateResult</name>
  </enumValues>
  <enumValues>
    <name>SetServiceDcResult</name>
  </enumValues>
  <enumValues>
    <name>SetExcludedBarcodesResult</name>
  </enumValues>
  <enumValues>
    <name>DeleteFileResult</name>
  </enumValues>
  <enumValues>
    <name>SaveFileResult</name>
  </enumValues>
  <enumValues>
    <name>GetModifiedOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>SetPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>FinalizationPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>GetDeliveryCostCalculationTariffsResult</name>
  </enumValues>
  <enumValues>
    <name>getCustomerLinkResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersStateResult</name>
  </enumValues>
  <enumValues>
    <name>uploadReceiptsResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersZoneResult</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/ПричиныОтказаПереноса/ПричиныОтказаПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныОтказаПереноса</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Брак</name>
      <description>Брак</description>
    </items>
    <items>
      <name>КлиентаНетНаМесте</name>
      <description>Клиента нет на месте</description>
    </items>
    <items>
      <name>НеДозвонилисьДоКлиента</name>
      <description>Не дозвонились до клиента</description>
    </items>
    <items>
      <name>НеТотТовар</name>
      <description>Не тот товар</description>
    </items>
    <items>
      <name>НеУспелиПоВремени</name>
      <description>Не успели по времени</description>
    </items>
    <items>
      <name>ОтказКлиента</name>
      <description>Отказ клиента</description>
    </items>
    <items>
      <name>ПереносЗаказовВСвязиСПревышениемЛимита</name>
      <description>Перенос заказов в связи с превышением лимита</description>
    </items>
    <items>
      <name>ПоПисьмуМагазина</name>
      <description>По письму магазина</description>
    </items>
    <items>
      <name>ПоПросьбеКлиента</name>
      <description>По просьбе клиента</description>
    </items>
  </predefined>
  <attributes>
    <name>СторонаПретензии</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводНовогоАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьСменуИнтервала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВАдминке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораПриГрупповойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступностьПоПричинамНеВыполненияЗаказа</name>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/CommonModules/РаботаСАдминкойСервер/Module.bsl
Процедура ОчиститьТранспортПоЗаказу(НомерЗаказа) Экспорт
    Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
    евген.ЗапросКИнтернетМагазину("
	|EXEC p1c_removeCarriageFromOrder " + Формат(НомерЗаказа, "ЧГ=") + "
    |EXEC mp_saveOrderHistory " + Формат(НомерЗаказа, "ЧГ="), Соединение);
КонецПроцедуры

Процедура РегламентОбработкаОшибокSQL() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ОшибкиSQL.ТекстЗапроса КАК ТекстЗапроса,
	            |	ОшибкиSQL.Период КАК Период,
	            |	ОшибкиSQL.ИсточникДанных КАК ИсточникДанных,
	            |	ОшибкиSQL.ТипОперации КАК ТипОперации,
	            |	ОшибкиSQL.Ошибка КАК Ошибка
	            |ИЗ
	            |	РегистрСведений.ОшибкиSQL КАК ОшибкиSQL
	            |ГДЕ
	            |	ОшибкиSQL.ОшибкаСвязанаСДоступностью = ИСТИНА
	            |	И ОшибкиSQL.ОшибкаОбработанаРегламентом = ЛОЖЬ
	            |	И ОшибкиSQL.Период МЕЖДУ &НачДата И &КонДата";
	ТекД = ТекущаяДата();
	
	Зап.УстановитьПараметр("НачДата", ТекД - 86400);
	Зап.УстановитьПараметр("КонДата", ТекД);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();
	
	МассивОбработанныхОшибок = Новый Массив;
	
	Пока Выб.Следующий() Цикл
		Евген.ЗапросКИнтернетМагазину(Выб.ТекстЗапроса, Подкл,,Истина);
		
		Наб = РегистрыСведений.ОшибкиSQL.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(Выб.Период);
		Наб.Отбор.ИсточникДанных.Установить(Выб.ИсточникДанных);
		Наб.Отбор.ТипОперации.Установить(Выб.ТипОперации);
		
		Наб.Прочитать();
		
		Для Сч = 0 По Наб.Количество() - 1 Цикл
			Запись = Наб[Сч];
			Если Запись.ТекстЗапроса = Выб.ТекстЗапроса И Запись.Ошибка = Выб.Ошибка тогда
				Запись.ОшибкаОбработанаРегламентом = Истина;
				Запись.ДатаОбработкиРегламентом = ТекущаяДата();
			КонецеСли;	
		КонецЦикла;	
		
		Наб.УстановитьКомментарийВерсииИсторииДанных("Обработка ошибки SQL регламентом");
		Наб.Записать(Истина);
		
		МассивОбработанныхОшибок.Добавить(Выб.ТекстЗапроса);
	КонецЦикла;	
	
	Если МассивОбработанныхОшибок.Количество() > 0 Тогда
		ТекстПисьма = "Количество обработанных ошибок: " + Формат(МассивОбработанныхОшибок.Количество(), "") + Символы.ПС;
		для Сч = 0 По МассивОбработанныхОшибок.Количество() - 1 Цикл
			ТекстПисьма = ТекстПисьма + Символы.ПС + "-----------------------------------------------" + Символы.ПС;
			ТекстПисьма = ТекстПисьма + МассивОбработанныхОшибок[Сч];
		КонецЦикла;	
		
		lem.ОтправитьНормальноеСообщениеАдминам("Регламент обработки ошибок SQL", ТекстПисьма);
	КонецеСли;
КонецПроцедуры	

Функция СопоставлениеИнициатораСостоянияДляАдминки() Экспорт
	
	 СопоставлениеИнициатора = Новый Соответствие();
	 СопоставлениеИнициатора.Вставить(Перечисления.ИнициаторыСостояния.ИнтернетМагазин, 1);
	 СопоставлениеИнициатора.Вставить(Перечисления.ИнициаторыСостояния.Клиент, 2);
	 СопоставлениеИнициатора.Вставить(Перечисления.ИнициаторыСостояния.ТранспортнаяКомпания, 3);
	 
	 Возврат СопоставлениеИнициатора;                                                                             
	 
КонецФункции	

Функция ИнициаторСостоянияВАдминку(ИнициаторСостояния, СопоставлениеИнициатора = Неопределено) Экспорт
	
	Если СопоставлениеИнициатора = Неопределено Тогда
		 СопоставлениеИнициатора = СопоставлениеИнициатораСостоянияДляАдминки();
	Конецесли;	 
	
	ИнициаторСостоянияВАдминку = Неопределено;
	
	Если ЗначениеЗаполнено(ИнициаторСостояния) Тогда
		Попытка
			ИнициаторСостоянияВАдминку = СопоставлениеИнициатора[ИнициаторСостояния];
		Исключение
			ИнициаторСостоянияВАдминку = Неопределено;
		Конецпопытки;
	Иначе
		ИнициаторСостоянияВАдминку = Неопределено;
	КонецЕсли;	
	
	Возврат ИнициаторСостоянияВАдминку;
	
КонецФункции

	
Процедура РегламентВыгрузкаПричинОтказовПереносов(КодПланаОбмена) Экспорт
	
	УзелОбмена = ПланыОбмена.ОбменСАдминкой.НайтиПоКоду(КодПланаОбмена);
	
	МассивДанных = Новый Массив;
	
	Выборка = ПланыОбмена.ВыбратьИзменения(УзелОбмена, 1);
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Получить();
		
		//Сообщить("Объект "+СпрОбъект+" зарегистрирован к отправке");
		
		МассивДанных.Добавить(СпрОбъект.Ссылка);
		
		//ПланыОбмена.УдалитьРегистрациюИзменений(Узелок, СпрОбъект);
		
		//Сообщить("Объект "+СпрОбъект+" удален из отправки");
		
	КонецЦикла; 
	
	Если МассивДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныОтказаПереноса.Ссылка КАК Ссылка,
		|	ПричиныОтказаПереноса.Код КАК code1C,
		|	ПричиныОтказаПереноса.Наименование КАК name,
		|	ВЫБОР
		|		КОГДА ПричиныОтказаПереноса.ПометкаУдаления
		|				ИЛИ ПричиныОтказаПереноса.ЗапретВыбораВАдминке
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК isActual,
		|	ВЫБОР
		|		КОГДА ПричиныОтказаПереноса.СторонаПретензии = ЗНАЧЕНИЕ(Перечисление.СторонаПретензий.Партнер)
		|			ТОГДА 1
		|		КОГДА ПричиныОтказаПереноса.СторонаПретензии = ЗНАЧЕНИЕ(Перечисление.СторонаПретензий.Компания)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК guilty,
		|	ВЫБОР
		|		КОГДА ПричиныОтказаПереноса.ИнициаторСостояния = ЗНАЧЕНИЕ(Перечисление.ИнициаторыСостояния.ИнтернетМагазин)
		|			ТОГДА 1
		|		КОГДА ПричиныОтказаПереноса.ИнициаторСостояния = ЗНАЧЕНИЕ(Перечисление.ИнициаторыСостояния.Клиент)
		|			ТОГДА 2
		|		КОГДА ПричиныОтказаПереноса.ИнициаторСостояния = ЗНАЧЕНИЕ(Перечисление.ИнициаторыСостояния.ТранспортнаяКомпания)
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК initiator,
		|	ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ПричинаНевыполнения.КодАдминки КАК eventId,
		|	ВЫБОР
		|		КОГДА ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		|			ТОГДА 0
		|		КОГДА ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
		|			ТОГДА 1
		|		КОГДА ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
		|			ТОГДА 2
		|		ИНАЧЕ -1
		|			
		|	КОНЕЦ КАК deliveryType
		|ИЗ
		|	Справочник.ПричиныОтказаПереноса КАК ПричиныОтказаПереноса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПричиныОтказаПереноса.ДоступностьПоПричинамНеВыполненияЗаказа КАК ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа
		|		ПО (ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.Ссылка = ПричиныОтказаПереноса.Ссылка)
		|			И (ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
		|				ИЛИ ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		|				ИЛИ ПричиныОтказаПереносаДоступностьПоПричинамНеВыполненияЗаказа.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
		|ГДЕ
		|	ПричиныОтказаПереноса.Ссылка В(&МассивДанных)
		|ИТОГИ
		|	МИНИМУМ(code1C),
		|	МИНИМУМ(name),
		|	МИНИМУМ(isActual),
		|	МИНИМУМ(guilty),
		|	МИНИМУМ(initiator)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивДанных", МассивДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивПараметров = Новый Массив;
	
	Пока ВыборкаСсылка.Следующий() Цикл
			
		СтруктураПараметров = Новый Структура("code1C"); 	
		СтруктураПараметров.Вставить("name");
		СтруктураПараметров.Вставить("isActual");
		СтруктураПараметров.Вставить("guilty");
		СтруктураПараметров.Вставить("initiator");
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаСсылка);
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		МассивТЧ = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
			Если (НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.eventId))
				ИЛИ (ВыборкаДетальныеЗаписи.deliveryType < 0) Тогда
			Иначе			
				СтруктураТЧ = Новый Структура("eventId");
				СтруктураТЧ.Вставить("deliveryType");
				
				ЗаполнитьЗначенияСвойств(СтруктураТЧ, ВыборкаДетальныеЗаписи);
				
				ПреобразоватьЗначенияСтруктурыВСтроку(СтруктураТЧ);
				МассивТЧ.Добавить(СтруктураТЧ);				
			КонецЕсли; 	
			
		КонецЦикла;
		
		Если МассивТЧ.Количество() > 0 Тогда
			СтруктураПараметров.Вставить("events", МассивТЧ);
		КонецЕсли; 
		
		ПреобразоватьЗначенияСтруктурыВСтроку(СтруктураПараметров);
		
		МассивПараметров.Добавить(СтруктураПараметров);
		
	КонецЦикла;
		
	ПараметрыЗапроса = Новый Структура;		
	ПараметрыЗапроса.Вставить("reasons", МассивПараметров);
	
	СтруктураВозврата = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(Перечисления.ВидыЗапросовWEBСервис.UpdateReasonsDirectoryResult, ПараметрыЗапроса,,,Истина);
	Если НЕ СтруктураВозврата.Успешно Тогда
		//ВызватьИсключение СтруктураВозврата.ОписаниеОшибки;
		Возврат;	
	КонецЕсли;
	
	Для каждого ПричинаОтказа Из МассивДанных Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ПричинаОтказа);
	КонецЦикла; 
	
КонецПроцедуры	

//CeHbKA #2941
Процедура ПреобразоватьЗначенияСтруктурыВСтроку(СтруктураОбработки)
	
	Для каждого ЭлементСтруктуры Из СтруктураОбработки Цикл
		
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Массив") Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(ЭлементСтруктуры.Значение) <> Тип("Строка") Тогда
			СтруктураОбработки[ЭлементСтруктуры.Ключ] = Строка(Число(ЭлементСтруктуры.Значение));
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры
